import 'package:flutter/material.dart';
import 'package:nafith/raqi_app/shared/colors.dart';

class TermsScreen extends StatefulWidget {
  const TermsScreen({Key? key}) : super(key: key);

  @override
  State<TermsScreen> createState() => _TermsScreenState();
}

class _TermsScreenState extends State<TermsScreen> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(),
      body: SingleChildScrollView(
        child: Padding(
          padding: const EdgeInsets.all(16.0),
          child: Column(
            children: [
              Icon(Icons.fact_check_outlined,size: 55,color: buttonsColor,),
              SizedBox(height: 15,),
              Text("الشروط والاحكام",style: TextStyle(fontWeight: FontWeight.bold,fontSize: 28),),
              Text("تطبيق نافث\n"
                  "\n(الرقية الشرعية - عن بعد)"
                  "الشروط والأحكام\n"
                  "سياسة الخصوصية\n"
                  "الحفاظ على سرية المعلومات :\n"
                  "أحد أهدافنا الرئيسية في نافث ، هو الحفاظ على خصوصية المستخدمين، فلذلك نحن في نافث نلتزم بعدم الكشف عن أي معلومات شخصية سواء للمختص أو المستفيد مثل 'الاسم، العنوان، البريد الإلكتروني، وغيرها' لأي جهة كانت في حدود المسموح لنا تبعاً لقانون المملكة العربية السعودية. ولن يسمح بالوصول لہذہ المعلومات إلا لفريق العمل المحترف المشرف على نافث .\n"
                  "البيانات التي نجمعها منك :\n"
                  "نقوم في (نافث )بجمع وحفظ البيانات التي يقوم المستفيد بإدخالها وهي على وجه التحديد، وهي :\n"
                  "1- البيانات التي تطلب من المستفيد في حسابه الشخصي في التطبيق، الاسم، رقم الجوال، كلمة المرور ويتم حفظ كلمة المرور مشفرة بما لا يخل بسریتها.\n"
                  "2- معلومات البطاقات مسبقة الدفع / بطاقات الائتمان /بطاقات مدى /فيزا وغيرها … التي يختار المستفيد إدخالها وحفظ بياناتها في حسابه الشخصي، بالقدر اللازم غير المخل بسريتها.\n"
                  "3- الملاحظات والشكاوى التي يقدمها المستفيد عبر خاصية تواصل معنا.\n"
                  "4- تقييم المستفيد للتطبيق والمختصين والخدمات المقدمة.\n"
                  "5- الرسائل التي يرسلها المستفيد على أي بريد إلكتروني خاص بنا.\n"
                  "كيف نستخدم بياناتك:\n"
                  "نقوم باستخدام بياناتك الشخصية وغير الشخصية بالقدر اللازم لخدمتك وفقاً للأغراض المشروعة التالية :\n"
                  "1- قد نستخدم معلومات الاتصال الخاصة بك للرد على استفساراتك وتلبية طلباتك أو لمساعدتك عند نسيانك كلمة المرور.\n"
                  "2- قيد الشكاوى التي تقدمها ومعالجتها وعرض نتيجتها، كما نقوم بحفظها لصيانة حقوقنا و على قدر أكبر من الأهمية حقوقك.\n"
                  "3- قد نستخدم الملاحظات والشكاوى التي تقدمها في تطوير خدماتنا وإزالة ما يواجه المستفيدون من صعوبات وعوائق في استخدام التطبيق.\n"
                  "4- نستخدم البيانات -غير الشخصية-التي نجمعها من خلال استخدامك لمنصتنا لأغراض تطوير وتحسين خدماتنا ولإجراء البحوث ذات الصلة، ولزيادة عملائنا من المستفيدين.\n"
                  "كيف نحمي بياناتك الشخصية:\n"
                  "نقوم بحماية بياناتك الشخصية من الوصول إليها أو كشفها أو إفشائها أو تبدیلها أو معالجتها -في غير ما ورد في سياسة الخصوصية أو الشروط والأحكام ، وفي سبيل المحافظة عليها فإننا نتبع الإجراءات التالية:\n"
                  "1- حفظ وتخزين بياناتك الشخصية في خدمات بیانات آمنة، كما نتخذ جميع ما يلزم من تدابير أمنية وفنية وتقنية لحماية منصتنا وخصوصيتك من أي وصول غير مصرح او غير مشروع.\n"
                  "2-  في حال وقع أي اختراق لمنصتنا ليصل لبياناتك الشخصية، فسنقوم باتخاذ ما في وسعنا من الإجراءات اللازمة لمنعه وإيقافه ومعالجة الواقعة.\n"
                  "3- لمساعدتك في حماية معلوماتك الشخصية، فنأمل منك عدم مشاركتها مع أي شخص آخر، والاتصال بنا فور علمك بأي وصول غير مصرح لحسابك الشخصى أو لكلمة المرور الخاصة بك لاتخاذ ما يلزم .\n"
                  "مدة الاحتفاظ بياناتك الشخصية.\n"
                  "نحتفظ ببياناتك الشخصية طوال المدة اللازمة لخدمتك, وطوال مدة استمرارك في الحصول على خدماتنا, وطوال مدة بقاء حسابك مسجلاً لدينا. كما قد نضطر للاحتفاظ ببعض البيانات الشخصية الناتجة عن استخدامك لتطبيقنا انفاذاً لأنظمة أو لوائح أو قرارات تلزمنا ذلك, وذلك بأدنى حد ممكن يتوافق مع النظام.\n"
                  "خلل تقني في التطبيق وانقطاع الخدمة :\n"
                  "نحن نبذل قصارى جهدنا حتى يعمل نافث على أفضل ما يكون ويتم تقديم الجلسات في بيئة آمنة مستقرة وتحافظ على خصوصيتك. ولكن إن حصل خلل تقني فنرجو منكم التواصل معنا وبإذن الله وسيتم حل المشكلة.\n"
                  "الحساب الشخصى وكلمة السر :\n"
                  "1- يلتزم المستفيد بالحفاظ على سرية معلوماته الشخصية والرقم السري تحديداً. وفي حال حدوث أي خدمات باستخدام كلمة السر، فسيتحمل المستفيد كافة المسئوليات المترتبة على ذلك. دون أدنى مسؤولية تقع على نافث.\n"
                  "2- يتحمل المستفيد مسئولية جميع البيانات والمعلومات التي يشاركونها عبر منصة نافث.\n"
                  "تغییر سياسة الخصوصية :\n"
                  "يجوز لنا تعديل سياسة الخصوصية وإجراء تغيرات عليها في أي وقت وعند حدوث ذلك سنقوم بنشر آخر تحديث لہا علی تطبیق (نافث), ويعتبر استمرارك في الاستفادة من خدماتنا وعدم الغاء حسابك الشخصي قبولاً منك بما في جاء في سياسة الخصوصية بعد التحديث.\n"
                  "الرقابة على المحتوى:\n"
                  "- نحن في نافث نحتفظ بالحق في إدارة ومراقبة كافة محتويات المنصة، ولذلك نحتفظ بالحق في حذف أو تحرير\n"
                  "أو إزالة أي مستفيد ينشر أمور مخالفة لأهداف المنصة وشروطها وأحكامها. ولذلك عند موافقتك للتسجيل معنا فأنت توافق ضمنيا على شروط وأحكام المنصة وعلى عدم مخالفتها.\n"
                  "- هذه البنود والسياسات محل تطوير وتحسين دائم، لذلك على المستفيدين مراجعتها بشكل دوري.\n"
                  "أحقية الحصول على الخدمات:\n"
                  "أنت تقر وتضمن التالي:\n"
                  "1- أنه لم يسبق أن تم تعطيل استخدامك لخدمات لبيه أو منعك من استخدامه في أي وقت من الأوقات.\n"
                  "2- أي سوء استخدام من قبل المستفيد خارج إطار العلاقة الموضحة سيؤدي ذلك الى إيقاف حسابه مباشرة.\n"
                  "3- في حال كنت تبلغ أقل من 18 سنة فأنت تقر بأنك أخذت الأذن من الوصى لحجز موعد داخل تطبيق لبيه.\n"
                  "التعهدات والضمانات :\n"
                  "1- سوف تراجع وتمتثل لأي إشعارات يتم إرسالها من خلال نافث فيما يتعلق باستخدامكم للخدمة المقدمة من تطبيق نافث.\n"
                  "2- لن تستخدم المعلومات، أو المحتوى أو أي بيانات تصل إليها أو تحصل علیہا من خلال خدمات نافث في أي غرض آخر إلا للاستعمال الشخصي وسوف تستخدم التطبيق والخدمة حصراً للأغراض الخاصة بك ولن تبيعها لأي طرف ثالث.\n"
                  "3- لن تستخدم الخدمة أو التطبيق للتسبب بإيذاء أو مضايقة أو إزعاج أحد ما.\n"
                  "4- لن تعرقل التشغيل السليم لتطبيق نافث.\n"
                  "5- لن تحاول إلحاق الضرر بالخدمة أو التطبيق بأي شكل من الأشكال.\n"
                  "6- سوف تحافظ على كلمة المرور لحسابك أو أي وسيلة تعريف نقدمها لك وتتيح الدخول إلى حسابك، بشكل آمن وسري.\n"
                  "حقوق الملكية الفكرية:\n"
                  "جميع حقوق الملكية الفکریة لہذہ الخدمات وكافة المواد المتعلقة بها أو التي تظهر داخل التطبيق هي ملكية لمؤسسة نافث ، سواء كانت مسجلة أو غير مسجلة في التطبيق وجميع معلومات المحتوى والتصميمات الواردة على التطبيق تعتبر ملك لنا بما في ذلك على سبيل المثال وليس الحصر: النصوص،الرسوم، البرامج، الصور والفيديو والموسيقى والصوت، واختيارها وتنسيقها، فضلاً عن جميع مصنفات البرمجيات ورموز المصادر والبرامج الرئيسية\n"
                  "- يجب عليك ألا تقوم بالسماح لأي شخص، لأي سبب من الأسباب، باستخدام الحساب الخاص بك من أجل الحصول على جلسة او الاستفادة من أي خدمة من خدمات شركة نافث.\n"
                  "الأسعار :\n"
                  "تعتمد الأسعار الظاهرة في التطبيق لكل خدمة قبل الطلب وستكون ظاهرة في الصفحة الشخصية لكل مقدم خدمة 'المختص'، وقد يختلف السعر بحسب مقدم الخدمة 'المختص' الذي له الحق في تعديل السعر متى ما أراد وسيتم تحديث سعر الجلسة بناءً على التغير الحاصل.\n"
                  "الدفع :\n"
                  "1- يحتفظ نافث لنفسه بالحق في فرض رسوم جديدة على استخدام التطبيق أوالخدمة أو كليهما.\n"
                  "2- يتوجب عليك دفع قيمة الخدمة “الجلسة” إلى نافث عند حجز الموعد مع المختص.\n"
                  "3- طرق الدفع المتاحة من داخل المنصة (مدى - ابل باي - فيزا - الدفع عبر الأقساط – الدفع الآجل وغيره …)\n"
                  "سياسة الاسترجاع :\n"
                  "1- يحق لطالب الجلسة استرجاع المبلغ المدفوع كاملاً في محفظة العميل داخل التطبيق، قبل بدء الجلسة بمدة لا تقل عن 3 ساعات.\n"
                  "2- في حالة تأجيل الجلسة قبل موعدها بمدة أقل من 3 ساعات سيتم خصم 20 % من تكلفة الجلسة المدفوعة.\n"
                  "3- إذا لم يتم حضور الموعد للمرة الاولى بعد تأكيد الموعد مع المختص يتم خصم 30% في حال طلب الاسترجاع، وفي حال عدم حضور الموعد للمرة الثانية توالياً لا يحق للعميل طلب الاسترجاع، ولا يتم تعويضها بجلسة أخرى.\n"
                  "4- لا يمكن للعميل استرجاع المبلغ بعد استكمال الجلسة.\n"
                  "5- يتم استرجاع تكلفة الجلسة كاملة في حالة إلغاء الموعد من جانب المختص وعدم رغبتك بتحويل حجز الجلسة لمختص آخر، أو الاحتفاظ بالمبلغ في محفظتك الشخصية.\n"
                  "6- إذا حدثت أي مشكلة تقنية أثناء إجراء الجلسة، يرجي التواصل مع فريق خدمة العملاء لاستكمال الجلسة، وإذا لم يتم حلها سوف يتم تعويضها بموعد آخر.\n"
                  "المسؤولية القانونية :\n"
                  "1- المعلومات والتوصيات والخدمات أو أي منها التي قدمت لك من خلال موقع الويب أو التطبيق هي لأغراض إتمام الخدمة بناءً على الطلب المقدم.\n"
                  "2- سيحافظ نافث قدر الإمكان على صحة وتحديث الموقع والتطبيق ومحتوياته، وذلك لا يتنافى مع وجود الجانب التطويري.\n"
                  "3- لا يتحمل نافث المسؤولية عن أي أضرار تنتج عن استخدام (أو عدم القدرة على استخدام) الموقع أو التطبيق، بما في ذلك الأضرار التي تسببها البرامج الضارة أو الفيروسات، كما لا تتحمل مسؤولية عدم صحة أو عدم اكتمال المعلومات أو موقع الويب أو التطبيق، ما لم يكن هذا الضرر ناتج عن سوء سلوك عمدي أو عن إهمال جسيم من جانب نافث.\n"
                  "تعديل الخدمات :\n"
                  "يحتفظ نافث بحقه، وبإرادته المنفردة، بأن يقوم في أي وقت بالآتي:\n"
                  "1- تغيير الخدمات أو أي مواد مرتبطة بها، أو إيقاف نشر خدماتها.\n"
                  "2- إذا قرر نافث إيقاف نشر خدماته، فإنها قد تقوم بإرادتها باستبدال الخدمات بمواد أخرى مشابهة.\n"
                  "حدود المسئولية :\n"
                  "- لا يقدم نافث أي ضمانات، واضحة أو ضمنية، تتعلق بالخدمات، فہی جميعها يتم تقديمها “كما هي”.\n"
                  "- يتعهد نافث بالعمل قدر الإمكان على توفير رقاة أكفاء من أجل تلبية احتياج المستفيد وتقديم خدمة مميزة له، ولكن لا يضمن مدى استفادة العميل من الخدمة؛ لأنها غير قابلة للقياس.\n"
                  "الأمان :\n"
                  "1- إنك تقر بتحملك المسئولية منفرداً تجاه خصوصية الخدمات المقدمة لك، وتكون مسئولاً منفرداً عن استخدامها من قبل أي شخص آخر باستخدام حسابك و/أو اسم المستخدم أو كلمة المرور أو مسوغات الوصول الخاصة بك.\n"
                  "2- توافق على إخطار تطبيق نافث إذا أصبحت على علم بخسارة او سرقة، أو استخدام غير مصرح به لأي كلمة مرور، أو اسم مستخدم أو عنوان بروتوكول الانترنت IP، أو غير ذلك من أساليب الوصول إلى الخدمات.\n"
                  "تعديل الخدمة وشروط المستخدم :\n"
                  "- يحتفظ نافث لنفسه بالحق، وفقًا لتقديرها وحدها، في تعديل أي شرط من شروط المستخدم الماثلة أو استبداله، أو تغيير الخدمة أو التطبيق أو تعلیقہما أو إيقافہما (بما في ذلك على سبيل المثال لا الحصر، توفير أي ميزة أو قاعدة بيانات أو محتوى) في أي وقت، وذلك بنشر إخطار على الموقع أو بإرسال إخطار لك من خلال الخدمة أو التطبيق أو عبر البريد الإلكتروني.\n"
                  "- يجوز لتطبيق نافث أن تضع قيودا على ميزات وخدمات معينة أو تقصر وصولك إلى أجزاء من الخدمة أو الخدمة بأكملها دون إخطار أو مسؤولية.\n"
                  "الإخطار :\n"
                  "يجوز لتطبيق نافث أن يرسل إخطارا عن طريق إرسال إخطار عام عن الخدمة أو التطبيق، أو بإرسال بريد إلكتروني إلى عنوانك البريدي المسجل في معلومات الحساب لدى نافث، أو بإرسال مكاتبة بالبريد العادي على عنوانك المسجل في معلومات الحساب لدى نافث.\n"
                  "القانون المعمول به وحل النزاعات :\n"
                  "- في حالة حدوث أي نزاعات أو خلافات أو حالات اختصام تنشأ عن تفسير هذه الشروط والأحكام وتنفيذها فإنها تخضع لكافة شروط المستخدم الماثلة للقوانين والأنظمة المطبقة في المملكة العربية السعودية وتفسر وفقاً له.\n"
                  "الراقي الشرعي /\n"
                  "الالتزام بصفات الراقي الشرعي:\n"
                  "هناك صفات للراقي الشرعي يجب الاطلاع  عليها:\n"
                  "من يقوم بالرقية الشرعية يجب أن يتصف بصفات خاصة، وذلك حتى لا يقع في الشرك والبدع، ومن هذه الصفات:\n"
                  "١. أن يكون محققاً التوحيد الخالص في القول والعمل.\n"
                  "٢. أن يكون معتقداً أن كلام الله - تعالى - له تأثير على الجن والشياطين.\n"
                  "٣. أن يكون عالماً بأحوال الجن والشياطين ومداخلهم على الإنس.\n"
                  "٤. أن يكون مبتعداً عن المحرمات والمنكرات وقريباً من الواجبات والطاعات.\n"
                  "٥. أن يكون ملازماً لذكر الله - تعالى -الذي هو الحصن الحصين.\n"
                  "٦. أن يخلص النية في المعالجة ولا يكن هدفه الأجرة مع العلم بأصل جواز الأجرة على المعالجة.\n"
                  "٧. أن يكون محافظاً على صلاة الجماعة في المساجد.\n"
                  "٨. أن يكون ملتزماً بالكتاب والسنة عند العلاج.\n"
                  "٩. أن يكتم الأسرار ويحفظ أعراض المُرقى عليهم.\n"
                  "١٠. أن يكون عنده معرفة بالأمراض النفسية والفروق بين العين والسِّحر والمس.\n"
                  "11- عدم استخدام التطبيق لأي غرض غير شرعي\n"
                  "وعندما يوجد استخدام يخالف ذلك يحق لإدارة التطبيق حذف  المخالف من دون سابق انذار.\n"
                  "وفقكم الله جميعا لمرضاته.\n"
                  "شروط الرقية :\n"
                  "1- يجب أن تكون بكلام الله سبحانه وتعالى.\n"
                  "2- يجب أن تكون بأسماء الله تعالى وصفاته.\n"
                  "3- يجب أن تكون بالمأثور عن النبي عليه الصلاة والسلام.\n"
                  "4- يجب أن تكون بلسان عربي.\n"
                  "صفات المسترقي :\n"
                  "1- النية الصادقة في طلب الرقية واليقين في الاستشفاء بالقرآن والسنة.\n"
                  "2- كمال التوكل على الله وأنه الشافي ، وأن الراقي مجرد سبب للوصول للشفاء\n"
                  "3- عدم استخدام التطبيق لأي غرض غير شرعي\n"
                  "وعندما يوجد استخدام يخالف ذلك يحق لإدارة التطبيق حذف المخالف من دون سابق انذار.\n"
                  "11- لدى الراقي القوة والشجاعة القلبية لمواجهة الجن والشياطين والتحدث معهم ومعرفة دحضهم بالحجة والبرهان والانكار على إيذائهم .\n"
                ,style: TextStyle(fontSize: 16),)
            ],
          ),
        ),
      ),
    );
  }
}
